{
  "regularTemplates": [
    {
      "id": 1,
      "body": "Dear [MP_NAME],\n\nI am writing to you as one of your constituents. As I am writing this email, millions of Iranians have taken to the streets all over Iran since late December 2025, to protest against the Islamic Republic of Iran. The government has shut down the internet and phone lines. For [DAYS_COUNT] consecutive days, we have been unable to reach our families in Iran. The regime has held the Iranian people hostage and by cutting off internet connectivity and isolating Iran from the outside world, it has intensified its crackdown on protesters. There have been reports that thousands of protestors have been killed and countless others injured.\n\nAs a Member of the Parliament of Canada, a country that is among the most diverse and home to one of the largest communities of the Iranian diaspora in the world, the role of your office extends far beyond the Canadian borders and your silence fails to stand with the Iranian-Canadians that looks to their elected representatives for leadership. As you know, for decades, the Iranian regime has held the country and the Iranians hostage, has engaged in systemic repression, including arbitrary detention, execution, torture, censorship and violent suppression of peaceful protests. In fact, the Government of Canada has formally recognized the Islamic Republic as a regime that has engaged in terrorism and systematic or gross human rights violations. Protestors are once again facing the brutality and terror of the Islamic Revolutionary Guard Corps (IRGC), which is recognized as a terrorist organization under the Criminal Code.\n\nI appreciate the multitude of other issues before Parliament and the demands of your office.  However, we are at a pivotal and defining moment in history - one in which every statement, action and expression of support matters. Time is of the essence. A revolution is underway.\n\nAs a constituent, I ask that you publicly and unequivocally denounce the Islamic Republic of Iran, acknowledge and amplify the voices of the protestors in Iran, advocate within the Parliament for continued and expanded measures to hold Iranian officials accountable, support independent human rights investigations, and clearly stand with the people of Iran. When our leaders speak unequivocally and consistently, it sends a signal that Canada does not condone and will not normalize repression, terrorism, or overlook state violence.\n\nThis is a revolution for a free Iran and a better world. Stand with us.\n\n[CONSTITUENCY_INFO]\n\nSincerely,"
    },
    {
      "id": 2,
      "body": "Dear [MP_NAME],\n\nAs I am writing this email, millions of Iranians have taken to the streets for over two consecutive weeks, to protest against the Islamic Republic of Iran. The government of Iran is committing heinous crimes against the Iranian people, and has shut down the internet and phone lines. For [DAYS_COUNT] consecutive days, we have been unable to reach our families in Iran. The regime has held the Iranian people hostage and by cutting off internet connectivity and isolating Iran from the outside world, it has intensified its crackdown on protesters and various reports indicate that it has murdered upwards of twelve thousand (12,000) protestors. The regime will continue its killings unless the international community including the Government of Canada stands with the people of Iran. \n\nAs a Member of the Parliament of Canada, a country that is among the most diverse and home to one of the largest communities of the Iranian diaspora in the world, the role of your office extends far beyond the Canadian borders and your silence fails to stand with the Iranian-Canadians that looks to their elected representatives for leadership. As you know, for decades, the Iranian regime has held the country and the Iranians hostage, has engaged in systemic repression, including arbitrary detention, execution, torture, censorship and violent suppression of peaceful protests. In fact, the Government of Canada has formally recognized the Islamic Republic as a regime that has engaged in terrorism and systematic or gross human rights violations. Protestors are once again facing the brutality and terror of the Islamic Revolutionary Guard Corps (IRGC), which is recognized as a terrorist organization under the Criminal Code. \n\nTime is of the essence. Any delay in taking action directly translates to more loss of life. A revolution is underway and we need your support. \n\nAs a constituent, I ask that the Government of Canada call for a special session of the UN Human Rights Council and the establishment of an investigative mechanism to preserve all evidence of the crimes being committed by the Islamic Republic such that when the day comes the perpetrators are brought to justice and held accountable. \n\nI also ask that you publicly and unequivocally denounce the Islamic Republic of Iran, request acknowledge and amplify the voices of the protestors in Iran, advocate within the Parliament for continued and expanded measures to hold Iranian officials accountable, support independent human rights investigations, and clearly stand with the people of Iran. When our leaders speak unequivocally and consistently, it sends a signal that Canada does not condone and will not normalize repression, terrorism, or overlook state violence.\n\nThis is a revolution for a free Iran and a better world. Stand with us. \n\n\n\n[CONSTITUENCY_INFO]\n\nSincerely,"
    }
  ],
  "primeMinisterTemplate": {
    "body": "Dear Prime Minister Carney,\n\nI am writing to you as one of your constituents. As I am writing this email, millions of Iranians have taken to the streets all over Iran since late December 2025, to protest against the Islamic Republic of Iran. The government has shut down the internet and phone lines. For [DAYS_COUNT] consecutive days, we have been unable to reach our families in Iran. The regime has held the Iranian people hostage and by cutting off internet connectivity and isolating Iran from the outside world, it has intensified its crackdown on protesters. There have been reports that thousands of protestors have been killed and countless others injured. \n\nAs a Member of the Parliament of Canada, a country that is among the most diverse and home to one of the largest communities of the Iranian diaspora in the world, the role of your office extends far beyond the Canadian borders and your silence fails to stand with the Iranian-Canadians that looks to their elected representatives for leadership. As you know, for decades, the Iranian regime has held the country and the Iranians hostage, has engaged in systemic repression, including arbitrary detention, execution, torture, censorship and violent suppression of peaceful protests. In fact, the Government of Canada has formally recognized the Islamic Republic as a regime that has engaged in terrorism and systematic or gross human rights violations. Protestors are once again facing the brutality and terror of the Islamic Revolutionary Guard Corps (IRGC), which is recognized as a terrorist organization under the Criminal Code. \n\nI appreciate the multitude of other issues before Parliament and the demands of your office.  However, we are at a pivotal and defining moment in history - one in which every statement, action and expression of support matters. Time is of the essence. A revolution is underway. \n\nAs a constituent, I ask that you publicly and unequivocally denounce the Islamic Republic of Iran, acknowledge and amplify the voices of the protestors in Iran, advocate within the Parliament for continued and expanded measures to hold Iranian officials accountable, support independent human rights investigations, and clearly stand with the people of Iran. When our leaders speak unequivocally and consistently, it sends a signal that Canada does not condone and will not normalize repression, terrorism, or overlook state violence.\n\nThis is a revolution for a free Iran and a better world. Stand with us. \n\n\n\n[CONSTITUENCY_INFO]\n\nSincerely,"
  },
  "frenchTemplates": [
    {
      "id": 1,
      "body": "Cher/Chère [MP_NAME],\n\nJe vous écris en tant que l’un(e) de vos électeurs. Au moment où je rédige ce courriel, des milliers d’Iraniens sont descendus dans les rues d’Iran depuis la fin décembre 2025 pour protester contre la République islamique de l'Iran. Le gouvernement a coupé l’accès à Internet et aux lignes téléphoniques. Depuis [DAYS_COUNT] jours consécutifs, nous sommes incapables de joindre nos familles en Iran. Le régime a pris le peuple iranien en otage en interrompant la connectivité Internet et en isolant l’Iran du reste du monde, tout en intensifiant sa répression contre les manifestants. Des bilans font état de milliers de manifestants tués et d’innombrables autres blessés.\n\nEn tant que député(e) du Parlement du Canada — un pays parmi les plus diversifiés au monde et qui abrite l’une des plus grandes communautés de la diaspora iranienne — le rôle de votre fonction dépasse largement les frontières canadiennes, et votre silence ne répond pas aux attentes des Canadiens d’origine iranienne qui comptent sur leurs représentants élus pour faire preuve de leadership. Comme vous le savez, depuis des décennies, le régime iranien a pris le pays et son peuple en otage et s’est livré à une répression systémique, incluant la détention arbitraire, les exécutions, la torture, la censure et la répression violente des manifestations pacifiques. En fait, le gouvernement du Canada a officiellement reconnu la République islamique comme un régime ayant participé au terrorisme et à des violations systématiques ou flagrantes des droits de la personne. Les manifestations font une fois de plus face à la brutalité et à la terreur du Corps des gardiens de la révolution islamique (CGRI), reconnu comme une organisation terroriste en vertu du Code criminel.\n\nJe reconnais la multitude d’autres enjeux à l’ordre du jour du Parlement ainsi que les exigences de votre fonction. Toutefois, nous nous trouvons à un moment charnière et déterminant de l’histoire — un moment où chaque déclaration, chaque action et chaque expression de soutien comptent. Le temps presse. Une révolution est en cours.\n\nEn tant que citoyen(ne), je vous demande de dénoncer publiquement et sans équivoque la République islamique d’Iran, de reconnaître et d’amplifier la voix des manifestants en Iran, de plaider au sein du Parlement pour des mesures continues et élargies afin de tenir les responsables iraniens redevables de leurs actes, de soutenir des enquêtes indépendantes sur les violations des droits de la personne et d’affirmer clairement votre solidarité avec le peuple iranien. Lorsque nos dirigeants s’expriment de manière claire et cohérente, cela envoie un message fort : le Canada ne tolère pas et ne normalisera pas la répression, le terrorisme ni la violence étatique.\n\nIl s’agit d’une révolution pour un Iran libre et pour un monde meilleur. Tenez-vous à nos côtés.\n\n[CONSTITUENCY_INFO]\n\nSincèrement,"
    }
  ]
}
